-- houselist
DELETE FROM houselist WHERE houseid IN (17, 20, 21, 23, 26, 27, 28);

INSERT INTO houselist (houseid, address, price, STATUS, detail, userlist_id, userlist_name)
VALUES
    (1, '甘井子-泉水美域盛景-枫丹丽城D5区', 1800, '已出租', '58.64平方米, 南向, 1室1厅1卫', 31, '何小琳'),
    (2, '西岗-北京街-康平街', 950, '未出租', '160.00平方米, 西向, 3室0厅1卫', NULL, NULL),
    (3, '中山-南山首府', 7300, '已出租', '91.12平方米, 东南向, 2室1厅1卫', 32, '王大锤'),
    (4, '中山-安乐街', 950, '已出租', '21.00平方米, 东向, 3室1厅1卫', 29, '周晓二'),
    (5, '金州-金石滩-鲁能泰山7号', 2800, '未出租', '107.36平方米, 南/北向, 3室2厅1卫', NULL, NULL),
    (6, '西岗-实验小学同庆街', 950, '未出租', '19.00平方米, 西向, 3室1厅1卫', NULL, NULL),
    (7, '甘井子-泉水美域盛景-骏腾名苑', 2150, '未出租', '79.27平方米, 南/北向, 2室1厅1卫', NULL, NULL);

select * from houselist